Tekla Open API Reference for Tekla Structures 2025
RebarItemEnumerator.DeleteRebarItem Method
 Delete the RebarItem from the list
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool DeleteRebarItem(
	RebarItem rebarItem
)
Public Shared Function DeleteRebarItem (
	rebarItem As RebarItem
) As Boolean
Parameters
rebarItem
Type: Tekla.Structures.Catalogs.RebarItem
item to delete
Return Value
Type: Boolean
True on success
See Also
Reference
RebarItemEnumerator Class
Tekla.Structures.Catalogs Namespace